driver-tests/bpelse/assign/AssignJbi/test/echoGMonthDataType_Invoke/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns="http://stc.com/echoGMonthDataType">
<SOAP-ENV:Header/>
<SOAP-ENV:Body>
  <item xmlns="http://stc.com/echoGMonthDataType">
    <string>--01</string>
    <normalizedString>--01</normalizedString>
    <token>--01</token>
    <base64Binary>--01</base64Binary>
    <hexBinary>--01</hexBinary>
    <integer>--01</integer>
    <positiveInteger>--01</positiveInteger>
    <negativeInteger>--01</negativeInteger>
    <nonNegativeInteger>--01</nonNegativeInteger>
    <nonPositiveInteger>--01</nonPositiveInteger>
    <long>--01</long>
    <unsignedLong>--01</unsignedLong>
    <int>--01</int>
    <unsignedInt>--01</unsignedInt>
    <short>--01</short>
    <unsignedShort>--01</unsignedShort>
    <byte>--01</byte>
    <unsignedByte>--01</unsignedByte>
    <decimal>--01</decimal>
    <float>--01</float>
    <double>--01</double>
    <boolean>--01</boolean>
    <duration>--01</duration>
    <dateTime>--01</dateTime>
    <date>--01</date>
    <time>--01</time>
    <gYear>--01</gYear>
    <gYearMonth>--01</gYearMonth>
    <gMonth>--01</gMonth>
    <gMonthDay>--01</gMonthDay>
    <gDay>--01</gDay>
    <Name>--01</Name>
    <QName>--01</QName>
    <NCName>--01</NCName>
    <anyURI>--01</anyURI>
    <language>--01</language>
    <ID>--01</ID>
    <IDREF>--01</IDREF>
    <IDREFS>--01</IDREFS>
    <ENTITY>--01</ENTITY>
    <ENTITIES>--01</ENTITIES>
    <NMTOKEN>--01</NMTOKEN>
    <NMTOKENS>--01</NMTOKENS>
  </item>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
